fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>ВКМ_Сотрудник</name>
    <type><types>CatalogRef.Пользователи</types></type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type><types>Date</types><dateQualifiers><dateFractions>Date</dateFractions></dateQualifiers></type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type><types>Date</types><dateQualifiers><dateFractions>Date</dateFractions></dateQualifiers></type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type><types>String</types><stringQualifiers><length>200</length></stringQualifiers></type>
  </attributes>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВКМ_ПланОтпусковСотрудников/ВКМ_ПланОтпусковСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ПланОтпусковСотрудников</name>
  <periodicity>WithinDay</periodicity>
  <writeMode>Independent</writeMode>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_ДокументОснование</name>
    <type>
      <types>DocumentRef.ВКМ_ГрафикОтпусков</types>
    </type>
  </dimensions>
  <resources>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроведения(Отказ, Режим)

	// ВКМ_Изменение_Начало
	Если НЕ ЗначениеЗаполнено(ВКМ_Сотрудник) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не заполнен сотрудник.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ВКМ_ДатаНачала) Или НЕ ЗначениеЗаполнено(ВКМ_ДатаОкончания) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не заполнены даты отпуска.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	// ВКМ_Изменение_Конец

	Если ВКМ_ДатаОкончания < ВКМ_ДатаНачала Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Дата окончания отпуска меньше даты начала.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	// ВКМ_Изменение_Начало
	НаборЗаписей = РегистрыСведений.ВКМ_ПланОтпусковСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВКМ_ДокументОснование.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();

	Если ВКМ_ЕстьПересечениеПериодовОтпуска(ВКМ_Сотрудник, ВКМ_ДатаНачала, ВКМ_ДатаОкончания, Ссылка) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Найдено пересечение с уже запланированным отпуском сотрудника.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Запись = НаборЗаписей.Добавить();
	Запись.Период = Дата;
	Запись.ВКМ_Сотрудник = ВКМ_Сотрудник;
	Запись.ВКМ_ДокументОснование = Ссылка;
	Запись.ВКМ_ДатаНачала = ВКМ_ДатаНачала;
	Запись.ВКМ_ДатаОкончания = ВКМ_ДатаОкончания;
	Запись.ВКМ_Комментарий = Комментарий;
	НаборЗаписей.Записать();
	// ВКМ_Изменение_Конец

КонецПроцедуры

Функция ВКМ_ЕстьПересечениеПериодовОтпуска(Сотрудник, ДатаНачала, ДатаОкончания, ДокументОснование)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПланОтпусков.ВКМ_Сотрудник КАК ВКМ_Сотрудник
	|ИЗ
	|	РегистрСведений.ВКМ_ПланОтпусковСотрудников КАК ПланОтпусков
	|ГДЕ
	|	ПланОтпусков.ВКМ_Сотрудник = &Сотрудник
	|	И ПланОтпусков.ВКМ_ДокументОснование <> &ДокументОснование
	|	И ПланОтпусков.ВКМ_ДатаНачала <= &ДатаОкончания
	|	И ПланОтпусков.ВКМ_ДатаОкончания >= &ДатаНачала";
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);

	Выборка = Запрос.Выполнить().Выбрать();
	Возврат Выборка.Следующий();

КонецФункции

#КонецЕсли
